<?php

declare(strict_types=1);

namespace ZhandosProg\WriteSpelling\Dictionaries;

class KazakhDictionary
{

    public static array $words = [
        'zero' => 'нөл',
        'tenths' => [
            ['','бір','екі','үш','төрт','бес','алты','жеті', 'сегіз','тоғыз'],
            ['','бір','екі','үш','төрт','бес','алты','жеті', 'сегіз','тоғыз'],
        ],
        'hundredths1' => [
            'он',
            'он бір',
            'он екі',
            'он үш',
            'он төрт',
            'он бес',
            'он алты',
            'он жеті',
            'он сегіз',
            'он тоғыз'
        ],
        'hundredths2' => [
            2 => 'жиырма',
            3 => 'отыз',
            4 => 'қырық',
            5 => 'елу',
            6 => 'алпыс',
            7 => 'жетпіс' ,
            8 => 'сексен',
            9 => 'тоқсан'
        ],
        'hundreds' => [
            '',
            'жүз',
            'екі жүз',
            'үш жүз',
            'төрт жүз',
            'бес жүз',
            'алты жүз',
            'жеті жүз',
            'сегіз жүз',
            'тоғыз жүз'
        ],
        'units' => [
            ['тиын', 'тиын', 'тиын', 1],
            ['теңге', 'теңге', 'теңге', 0],
            ['мың', 'мың', 'мың', 1],
            ['миллион', 'миллион', 'миллион' , 0],
            ['миллиард', 'миллиард', 'миллиард', 0],
        ],
        'percent' => [
            [
                -2 => 'екі',
                -1 => 'бір',
                0 => 'нөл',
                1 => 'бір',
                2 => 'екі',
                3 => 'үш',
                4 => 'төрт',
                5 => 'бес',
                6 => 'алты',
                7 => 'жеті',
                8 => 'сегіз',
                9 => 'тоғыз',
                10 => 'он',
                11 => 'он бір',
                12 => 'он екі',
                13 => 'он үш',
                14 => 'он төрт',
                15 => 'он бес',
                16 => 'он алты',
                17 => 'он жеті',
                18 => 'он сегіз',
                19 => 'он тоғыз',
                20 => 'жиырма',
                30 => 'отыз',
                40 => 'қырық',
                50 => 'елу',
                60 => 'алпыс',
                70 => 'жетпіс' ,
                80 => 'сексен',
                90 => 'тоқсан',
                100 => 'жүз',
            ],
            ['бүтін', 'бүтін'],
            ['оннан', 'оннан'],
            ['жүзден', 'жүзден'],
            ['пайыз', 'пайыз', 'пайыз'],
        ]
    ];
}